<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"b122fbf599f5f7bdd9f7596bc7faaa490bd82448c18b23c69e687992e437d689","plan_job_ref":"Job Plan org changes and list them in a PR #4 at https://github.com/django-commons/membership/actions/runs/11222238673","plan_out_hash":"0ac0c25ac46dea8bc0d281a7434a1f4b9d712264b05ccd615e7e40e55bc58859","plan_hash":"b139dfe262e4ab954f3b3c39ed200b3eef8182ac845c773425c59b054a8a8af7","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform__
With var files: `terraform/production/org.tfvars
terraform/production/repositories.tfvars
`
With variables: `github_token = (sensitive value)`
<details>
<summary>Plan: 1 to import, 11 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # github_repository.this["django-typer"] will be updated in-place
  # (imported from "django-typer")
!~  resource "github_repository" "this" {
        allow_auto_merge            = false
!~      allow_merge_commit          = true -> false
!~      allow_rebase_merge          = true -> false
        allow_squash_merge          = true
!~      allow_update_branch         = false -> true
+       archive_on_destroy          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
!~      delete_branch_on_merge      = false -> true
        description                 = "Use Typer (type hints) to define the interface for your Django management commands."
        etag                        = "W/\"315445b0ebaa4e1e13cead57ec61aa48d375a9b5597f347f1e953eed4236dd36\""
        full_name                   = "django-commons/django-typer"
        git_clone_url               = "git://github.com/django-commons/django-typer.git"
        has_discussions             = true
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
!~      has_wiki                    = true -> false
!~      homepage_url                = "https://django-typer.rtfd.io" -> "django-typer.rtfd.io"
        html_url                    = "https://github.com/django-commons/django-typer"
        http_clone_url              = "https://github.com/django-commons/django-typer.git"
        id                          = "django-typer"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "django-typer"
        node_id                     = "************"
        primary_language            = "Python"
        private                     = false
        repo_id                     = 709043453
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:django-commons/django-typer.git"
        svn_url                     = "https://github.com/django-commons/django-typer"
        topics                      = [
            "admin",
            "cli",
            "click",
            "command-line",
            "commands",
            "django",
            "management",
            "python",
            "python3",
            "shell",
            "terminal",
            "typehints",
            "typer",
        ]
        visibility                  = "public"
!~      vulnerability_alerts        = false -> true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_environment.pypi["django-typer"] will be created
+   resource "github_repository_environment" "pypi" {
+       can_admins_bypass   = true
+       environment         = "pypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-typer"

+       reviewers {
+           teams = (known after apply)
        }
    }

  # github_repository_environment.testpypi["django-typer"] will be created
+   resource "github_repository_environment" "testpypi" {
+       can_admins_bypass   = true
+       environment         = "testpypi"
+       id                  = (known after apply)
+       prevent_self_review = false
+       repository          = "django-typer"
    }

  # github_team.repo_admin_team["django-typer"] will be created
+   resource "github_team" "repo_admin_team" {
+       create_default_maintainer = false
+       description               = "Admin team for the django-typer repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-typer-admins"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_committer_team["django-typer"] will be created
+   resource "github_team" "repo_committer_team" {
+       create_default_maintainer = false
+       description               = "Committers team for the django-typer repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-typer-committers"
+       node_id                   = (known after apply)
+       parent_team_id            = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team.repo_team["django-typer"] will be created
+   resource "github_team" "repo_team" {
+       create_default_maintainer = false
+       description               = "Main team for the django-typer repository"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "django-typer"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "closed"
+       slug                      = (known after apply)
    }

  # github_team_members.repo_admin_members["django-typer"] will be created
+   resource "github_team_members" "repo_admin_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "bckohan"
        }
+       members {
+           role     = "member"
+           username = "oliverandrich"
        }
    }

  # github_team_members.repo_team_members["django-typer"] will be created
+   resource "github_team_members" "repo_team_members" {
+       id      = (known after apply)
+       team_id = (known after apply)

+       members {
+           role     = "member"
+           username = "bckohan"
        }
+       members {
+           role     = "member"
+           username = "oliverandrich"
        }
    }

  # github_team_repository.repo_admin_team_access["django-typer"] will be created
+   resource "github_team_repository" "repo_admin_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "admin"
+       repository = "django-typer"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_committer_team_access["django-typer"] will be created
+   resource "github_team_repository" "repo_committer_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "maintain"
+       repository = "django-typer"
+       team_id    = (known after apply)
    }

  # github_team_repository.repo_team_access["django-typer"] will be created
+   resource "github_team_repository" "repo_team_access" {
+       etag       = (known after apply)
+       id         = (known after apply)
+       permission = "triage"
+       repository = "django-typer"
+       team_id    = (known after apply)
    }

  # github_team_settings.this["django-typer"] will be created
+   resource "github_team_settings" "this" {
+       id        = (known after apply)
+       team_id   = (known after apply)
+       team_slug = (known after apply)
+       team_uid  = (known after apply)

+       review_request_delegation {
+           algorithm    = "LOAD_BALANCE"
+           member_count = 2
+           notify       = false
        }
    }

Plan: 1 to import, 11 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan org changes and list them in a PR #4](https://github.com/django-commons/membership/actions/runs/11222238673)